excel
json
xml
text files

In [5]:
import pandas as pd

path = r"https://raw.githubusercontent.com/techficent/PythonDABatch/main/datasets/Loan_Status_Classification.csv"

df = pd.read_csv(path)

df

,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,0,1,1,0,0,6608,0,137,180,1,1,1
1,0,1,2,0,0,4226,1040,110,360,1,1,1
2,1,1,0,1,0,3167,2283,154,360,1,2,1
3,0,0,0,1,1,6950,0,175,180,1,2,1
4,0,1,0,1,0,3993,3274,207,360,1,2,1
...,...,...,...,...,...,...,...,...,...,...,...,...
293,1,0,0,1,0,3846,0,111,360,1,2,1
294,0,0,0,1,0,2435,0,75,360,1,1,0
295,0,0,2,1,0,4923,0,166,360,0,2,1
296,0,1,3,0,0,2071,754,94,480,1,2,1
297,1,0,0,1,0,2378,0,46,360,1,3,0

In [7]:
excel_df = pd.read_excel("data.xlsx")

excel_df

         Name  Age  Salary
0     Harshit   32   45000
1        Ajay   31   50000
2  Shreyanshi   30   35000

In [8]:
excel_df[       ["Age",	"Salary"]           ].mean()

Age          31.000000
Salary    43333.333333
dtype: float64

In [11]:
json_df = pd.read_json("data.json")

json_df

         Name  Age  Salary
0     Harshit   32   45000
1        Ajay   32   45000
2  Shreyanshi   32   35000